package com.github.tea_pack.sapphire;

import java.util.List;

import com.github.tea_pack.sapphire.entities.Client;
import com.github.tea_pack.sapphire.entities.View;
import com.github.tea_pack.sapphire.parsers.CSVParser;
import com.github.tea_pack.sapphire.parsers.ClientParser;
import com.github.tea_pack.sapphire.parsers.ViewParser;

public class ParserTests {

    public static void main(String[] args) {
        ParserTests tests = new ParserTests();
        tests.viewTest();
    }

    // @Test
    public void viewTest() {
        String data = """
                client;device;time_ch;ch_id;epg_name;time_epg;time_to_epg;duration;category;subcategory
                u011766;d008493;2024-10-01 05:35:38;216;Самые шокирующие гипотезы (16+);2024-10-01 05:00:00;2024-10-01 06:00:00;1462;Познавательное;Расследование
                u011766;d008493;2024-10-01 06:23:10;676;Улицы разбитых фонарей-10 Изнаночная петля (16+);2024-10-01 05:40:00;2024-10-01 06:30:00;410;Сериал;Детектив, Боевик, Криминал, Приключения
                u011766;d008493;2024-10-01 06:23:10;676;Утро. Самое лучшее (16+);2024-10-01 06:30:00;2024-10-01 08:00:00;5400;Досуг;Развлекательно-познавательное
                u011766;d008493;2024-10-01 06:23:10;676;Сегодня ;2024-10-01 08:00:00;2024-10-01 08:25:00;1500;Инфо;Информационная
                u011766;d008493;2024-10-01 08:41:53;149;Кумир 2-я - 6-я серии (16+);2024-10-01 06:15:00;2024-10-01 10:00:00;4687;Сериал;Детектив
                u011766;d008493;2024-10-01 08:41:53;149;Новости (16+);2024-10-01 10:00:00;2024-10-01 10:10:00;600;Инфо;Информационная
                u011766;d008493;2024-10-01 08:41:53;149;Кумир 6-я - 8-я серии (16+);2024-10-01 10:10:00;2024-10-01 13:00:00;10200;Сериал;Детектив
                u011766;d008493;2024-10-01 08:41:53;149;Новости ;2024-10-01 13:00:00;2024-10-01 13:15:00;900;Инфо;Информационная
                u011766;d008493;2024-10-01 08:41:53;149;Мировое соглашение (16+);2024-10-01 13:15:00;2024-10-01 14:10:00;3300;Инфо;ТВ-шоу
                u011766;d008493;2024-10-01 08:41:53;149;Дела судебные. Битва за будущее (16+);2024-10-01 14:10:00;2024-10-01 15:05:00;3300;Досуг;Развлекательно-познавательное
                u011766;d008493;2024-10-01 08:41:53;149;Дела судебные. Новые истории (16+);2024-10-01 15:05:00;2024-10-01 16:00:00;3300;Досуг;ТВ-шоу
                u011766;d008493;2024-10-01 08:41:53;149;Новости ;2024-10-01 16:00:00;2024-10-01 16:15:00;900;Инфо;Информационная
                u011766;d008493;2024-10-01 08:41:53;149;Дела судебные. Яблоко раздора (16+);2024-10-01 16:15:00;2024-10-01 17:15:00;3600;Досуг;Развлекательно-познавательное
                u011766;d008493;2024-10-01 17:21:49;149;Дела судебные. Деньги верните! (16+);2024-10-01 17:15:00;2024-10-01 18:30:00;4091;Досуг;Развлекательно-познавательное
                u011766;d008493;2024-10-01 19:32:11;181;Леонид Каневский. Народный артист 1-я серия (16+);2024-10-01 18:50:00;2024-10-01 19:50:00;1069;Познавательное;Документальная, Биографическая
                u011766;d008493;2024-10-01 20:46:05;469;Маршрут построен (6+);2024-10-01 17:00:00;2024-10-01 17:30:00;0;Досуг;Путешествия
                u011766;d008493;2024-10-01 20:46:05;469;Геноцид. Без права на жизнь (18+);2024-10-01 17:30:00;2024-10-01 17:50:00;1200;Познавательное;Документальная
                u011766;d008493;2024-10-01 21:08:41;504;1+1 (16+);2024-10-01 19:30:00;2024-10-01 21:40:00;1879;Фильм;Комедия
                u011766;d008493;2024-10-01 23:13:30;677;Люби их всех (18+);2024-10-01 21:20:00;2024-10-01 23:15:00;90;Фильм;Драма
                u011766;d008493;2024-10-01 23:13:30;677;Тренер (12+);2024-10-01 23:15:00;2024-10-02 01:50:00;9300;Фильм;Драма
                u008046;d012788;2024-10-01 03:46:51;223;"Тайны следствия-17 ""Случай на пробежке"", 2-я серия (16+)";2024-10-01 03:30:00;2024-10-01 04:34:00;2829;Сериал;Детектив
                u008046;d012788;2024-10-01 03:46:51;223;Перерыв в вещании ;2024-10-01 04:34:00;2024-10-01 05:00:00;1560;Остальное;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Парламентский час ;2024-10-01 05:05:00;2024-10-01 06:31:00;3292;Инфо;Политическая
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 06:31:00;2024-10-01 06:35:00;240;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Погода 24 ;2024-10-01 06:35:00;2024-10-01 06:40:00;300;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;День в истории ;2024-10-01 06:40:00;2024-10-01 07:18:00;2280;Познавательное;Документальная
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 07:18:00;2024-10-01 07:32:00;840;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Погода 24 ;2024-10-01 07:32:00;2024-10-01 07:50:00;1080;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Инструкция ;2024-10-01 07:50:00;2024-10-01 08:00:00;600;Познавательное;Развлекательно-познавательное
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 08:00:00;2024-10-01 08:32:00;1920;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Вести.net ;2024-10-01 08:32:00;2024-10-01 08:50:00;1080;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Погода 24 ;2024-10-01 08:50:00;2024-10-01 08:57:00;420;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 08:57:00;2024-10-01 09:42:00;2700;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Погода 24 ;2024-10-01 09:42:00;2024-10-01 09:45:00;180;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 09:45:00;2024-10-01 10:20:00;2100;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Интервью ;2024-10-01 10:20:00;2024-10-01 11:00:00;2400;Инфо;Интервью
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 11:00:00;2024-10-01 11:34:00;2040;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Вести.net ;2024-10-01 11:34:00;2024-10-01 11:46:00;720;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Специальный репортаж ;2024-10-01 11:46:00;2024-10-01 12:00:00;840;Инфо;Репортаж
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 12:00:00;2024-10-01 12:32:00;1920;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Погода 24 ;2024-10-01 12:32:00;2024-10-01 12:44:00;720;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Интервью ;2024-10-01 12:44:00;2024-10-01 13:00:00;960;Инфо;Интервью
                u008046;d012788;2024-10-01 05:36:08;182;Новости ;2024-10-01 13:00:00;2024-10-01 13:33:00;1980;Инфо;Информационная
                u008046;d012788;2024-10-01 05:36:08;182;Специальный репортаж ;2024-10-01 13:33:00;2024-10-01 14:00:00;1620;Инфо;Репортаж
                u008046;d012788;2024-10-01 14:18:01;223;Вести ;2024-10-01 14:00:00;2024-10-01 14:30:00;719;Инфо;Информационная
                u008046;d012788;2024-10-01 14:18:01;223;Местное время. Вести-Воронеж;2024-10-01 14:30:00;2024-10-01 14:55:00;1500;Инфо;Информационная
                u008046;d012788;2024-10-01 17:57:33;596;"Кухня по заявкам 301-я серия - ""Говяжьи хвосты томлёные в портвейне с чабером. Тушёная говядина с овощами с паприкой и майораном. Говяжий стей (12+)";2024-10-01 16:30:00;2024-10-01 18:03:00;327;Досуг;Кулинарная
                u008046;d012788;2024-10-01 19:10:54;643;"Футбол. FONBET Кубок России. Прямая трансляция ""Локомотив"" (Москва) - ""Оренбург"" ";2024-10-01 18:15:00;2024-10-01 20:30:00;4746;Спорт;Футбол
                u008046;d012788;2024-10-01 21:14:30;596;"Всё просто с Василием Емельяненко 114-я серия - ""Домашний обед по-русски"" (12+)";2024-10-01 20:28:00;2024-10-01 22:06:00;3090;Досуг;Кулинарная
                u008053;d008294;2024-10-01 03:26:01;255;По ту сторону смерти 2-й сезон 5-я серия (16+);2024-10-01 02:45:00;2024-10-01 03:30:00;239;Сериал;Детектив
                u008053;d008294;2024-10-01 03:26:01;255;По ту сторону смерти 2-й сезон 6-я серия (16+);2024-10-01 03:30:00;2024-10-01 04:30:00;3600;Сериал;Детектив
                u008053;d008294;2024-10-01 03:26:01;255;По ту сторону смерти 2-й сезон 7-я серия (16+);2024-10-01 04:30:00;2024-10-01 05:15:00;2700;Сериал;Детектив
                u008053;d008294;2024-10-01 03:26:01;255;Мультфильмы (0+);2024-10-01 05:15:00;2024-10-01 06:00:00;2700;Детям;Детский
                u008053;d008294;2024-10-01 03:26:01;255;"Премьера. ""Чудо-доктор"" 1-й сезон 67-я серия (16+)";2024-10-01 06:00:00;2024-10-01 06:45:00;2700;Сериал;Драма
                u008053;d008294;2024-10-01 03:26:01;255;Мультфильмы (0+);2024-10-01 06:45:00;2024-10-01 08:00:00;4500;Детям;Детский
                u008053;d008294;2024-10-01 03:26:01;255;Леди Баг и Супер-Кот Противостояние (6+);2024-10-01 08:00:00;2024-10-01 08:30:00;1800;Детям;Приключения
                u008053;d008294;2024-10-01 03:26:01;255;Новости (16+);2024-10-01 08:30:00;2024-10-01 08:40:00;600;Инфо;Информационная
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Дар шамана (16+);2024-10-01 08:40:00;2024-10-01 09:15:00;2100;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Жить и умереть (16+);2024-10-01 09:15:00;2024-10-01 09:45:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Стрекоза (16+);2024-10-01 09:45:00;2024-10-01 10:15:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Прости любимого (16+);2024-10-01 10:15:00;2024-10-01 10:45:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Рыба в мутной воде (16+);2024-10-01 10:45:00;2024-10-01 11:15:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Страх (16+);2024-10-01 11:15:00;2024-10-01 12:00:00;2700;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Месть (16+);2024-10-01 12:00:00;2024-10-01 12:30:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Моя бывшая (16+);2024-10-01 12:30:00;2024-10-01 13:00:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Пора - не пора (16+);2024-10-01 13:00:00;2024-10-01 13:30:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Два товарища (16+);2024-10-01 13:30:00;2024-10-01 14:00:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Гадалка Приз (16+);2024-10-01 14:00:00;2024-10-01 14:30:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Премьера. Гадалка Опасные куклы (16+);2024-10-01 14:30:00;2024-10-01 15:00:00;1800;Досуг;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Новости (16+);2024-10-01 15:00:00;2024-10-01 15:10:00;600;Инфо;Информационная
                u008053;d008294;2024-10-01 03:26:01;255;Слепая И что теперь (16+);2024-10-01 15:10:00;2024-10-01 15:45:00;2100;Познавательное;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;Слепая Жили-были (16+);2024-10-01 15:45:00;2024-10-01 16:15:00;1800;Познавательное;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;"Премьера. ""Слепая"" Каждый вторник (16+)";2024-10-01 16:15:00;2024-10-01 17:00:00;2700;Познавательное;Мистика
                u008053;d008294;2024-10-01 03:26:01;255;"Премьера. ""Лиса"" 1-й сезон 21-я серия (16+)";2024-10-01 17:00:00;2024-10-01 18:00:00;3600;Сериал;Детектив
                u008053;d008294;2024-10-01 03:26:01;255;Новости (16+);2024-10-01 18:00:00;2024-10-01 18:10:00;600;Инфо;Информационная
                u008053;d008294;2024-10-01 03:26:01;255;"Премьера. ""Лиса"" 1-й сезон 22-я серия (16+)";2024-10-01 18:10:00;2024-10-01 19:15:00;3900;Сериал;Детектив
                u008053;d008294;2024-10-01 03:26:01;255;"Премьера. ""Блонды"" 3-я серия (16+)";2024-10-01 19:15:00;2024-10-01 20:15:00;3600;Сериал;Детектив
                u008053;d008294;2024-10-01 03:26:01;255;"Премьера. ""Блонды"" 4-я серия (16+)";2024-10-01 20:15:00;2024-10-01 21:15:00;3600;Сериал;Детектив
                u008053;d008294;2024-10-01 22:22:18;169;События (6+);2024-10-01 22:00:00;2024-10-01 22:35:00;762;Инфо;Информационно-аналитическая
                u008053;d008294;2024-10-01 23:58:19;169;На обочине славы (16+);2024-10-01 23:05:00;2024-10-02 00:00:00;101;Познавательное;Биографическая
                u008053;d008294;2024-10-02 01:06:53;255;"Премьера. ""Дети тьмы"" (18+)";2024-10-01 23:45:00;2024-10-02 01:30:00;1387;Фильм;Триллер, Ужасы
                u008053;d008294;2024-10-02 02:13:28;179;Верну любимого Снова вместе (16+);2024-10-02 01:55:00;2024-10-02 02:20:00;392;Познавательное;Мистика, Драма
                u003790;d004635;2024-10-01 12:11:33;223;Вести ;2024-10-01 09:00:00;2024-10-01 09:30:00;1341;Инфо;Информационная
                u003790;d004635;2024-10-01 12:11:33;223;Местное время. Вести-Воронеж;2024-10-01 09:30:00;2024-10-01 09:55:00;1500;Инфо;Информационная
                u003790;d004635;2024-10-01 13:01:04;257;Модный приговор (0+);2024-10-01 09:20:00;2024-10-01 10:10:00;771;Досуг;Ток-шоу
                u003790;d004635;2024-10-01 13:39:02;179;Тест на отцовство (16+);2024-10-01 08:25:00;2024-10-01 10:40:00;326;Познавательное;ТВ-шоу
                u003790;d004635;2024-10-01 13:39:02;179;"Премьера. ""Понять. Простить"" ""Хитрюга"". ""Удачно обменялись"" (16+)";2024-10-01 10:40:00;2024-10-01 11:45:00;3900;Познавательное;Документальная, Драма
                u003790;d004635;2024-10-01 13:39:02;179;"Премьера. ""Порча"" ""Подачка"". ""Танцы на костях"" (16+)";2024-10-01 11:45:00;2024-10-01 12:55:00;4200;Познавательное;Познавательная
                u003790;d004635;2024-10-01 13:39:02;179;"Премьера. ""Знахарка"" Короткое лето (16+)";2024-10-01 12:55:00;2024-10-01 13:30:00;2100;Познавательное;Познавательная
                u003790;d004635;2024-10-01 13:39:02;179;"Премьера. ""Верну любимого"" Снова вместе (16+)";2024-10-01 13:30:00;2024-10-01 14:05:00;2100;Познавательное;Мистика, Драма
                u003790;d004635;2024-10-01 13:39:02;179;"Премьера. ""Голоса ушедших душ"" Дурная кровь (16+)";2024-10-01 14:05:00;2024-10-01 14:40:00;2100;Познавательное;Документальная
                u003790;d004635;2024-10-01 21:12:50;104;ДНК (16+);2024-10-01 17:50:00;2024-10-01 19:00:00;2983;Досуг;Ток-шоу
                u006932;d014024;2024-10-01 13:34:07;108;Премьера. Стальные стражи (6+);2024-09-30 22:00:00;2024-09-30 22:25:00;0;Детям;Семейный
                u006932;d014024;2024-10-01 13:34:07;108;Фиксики (0+);2024-09-30 22:25:00;2024-09-30 23:00:00;2100;Детям;Приключения
                u006932;d014024;2024-10-01 13:34:07;108;Смешарики. Пин-код (0+);2024-09-30 23:00:00;2024-09-30 23:30:00;1800;Детям;Образовательная
                u006932;d014024;2024-10-01 13:34:07;108;"Премьера. ""Буба"" Режиссёр (6+)";2024-09-30 23:30:00;2024-10-01 00:20:00;3000;Детям;Детский
                u006932;d014024;2024-10-01 13:34:07;108;Спина к спине (0+);2024-10-01 00:20:00;2024-10-01 00:55:00;2100;Детям;Детский
                u006932;d014024;2024-10-01 16:42:31;108;Фиксики (0+);2024-09-30 10:00:00;2024-09-30 10:30:00;511;Детям;Приключения
                u006932;d014024;2024-10-01 16:42:31;108;Премьера. Семь королевств Стоп, игра! (0+);2024-09-30 10:30:00;2024-09-30 11:05:00;2100;Детям;Детский
                u006932;d014024;2024-10-01 16:42:31;108;Ми-Ми-Мишки (0+);2024-09-30 11:05:00;2024-09-30 11:40:00;2100;Детям;Детский
                u006932;d014024;2024-10-01 16:42:31;108;Хранители Кью (0+);2024-09-30 11:40:00;2024-09-30 12:00:00;1200;Детям;Семейный
                u006932;d014024;2024-10-01 16:42:31;108;Время малышей (0+);2024-09-30 12:00:00;2024-09-30 13:00:00;3600;Детям;Развлекательно-познавательное
                u006932;d014024;2024-10-01 19:25:20;132;Премьера. Премьера-хит (0+);2024-10-01 19:20:00;2024-10-01 19:30:00;280;Досуг;Развлекательная
                u006932;d014024;2024-10-01 20:10:38;132;Музпривет (0+);2024-10-01 14:00:00;2024-10-01 15:20:00;136;Досуг;Музыка
                u006932;d014024;2024-10-01 20:20:21;132;Мультконцерт (0+);2024-10-01 19:30:00;2024-10-01 20:30:00;579;Детям;Музыка
                u006932;d014024;2024-10-01 20:48:26;108;Сказка на ночь Маша и Медведь, Машины сказки (0+);2024-10-01 20:05:00;2024-10-01 21:00:00;694;Детям;Семейный
                u006932;d014024;2024-10-01 21:01:27;108;Фиксики (0+);2024-09-30 10:00:00;2024-09-30 10:30:00;1685;Детям;Приключения
                u006932;d014024;2024-10-01 21:01:27;108;Премьера. Семь королевств Стоп, игра! (0+);2024-09-30 10:30:00;2024-09-30 11:05:00;2100;Детям;Детский
                u006932;d014024;2024-10-01 21:01:27;108;Ми-Ми-Мишки (0+);2024-09-30 11:05:00;2024-09-30 11:40:00;2100;Детям;Детский
                u006932;d014024;2024-10-01 23:09:24;108;Фиксики (0+);2024-10-01 05:00:00;2024-10-01 06:00:00;3436;Детям;Приключения
                u006932;d014024;2024-10-02 00:51:08;108;Спина к спине (0+);2024-10-02 00:20:00;2024-10-02 00:55:00;232;Детям;Детский
                u005115;d011840;2024-10-01 10:07:21;250;СОВБЕЗ (16+);2024-10-01 10:00:00;2024-10-01 11:00:00;3159;Познавательное;Познавательная
                u005115;d011840;2024-10-01 11:21:00;218;Папины дочки. Новые 2-й сезон 7-я - 11-я серии (12+);2024-10-01 09:00:00;2024-10-01 11:35:00;840;Сериал;Комедия
                u005115;d011840;2024-10-01 13:04:33;677;Запретная зона (16+);2024-10-01 11:20:00;2024-10-01 13:15:00;627;Фильм;Триллер
                u005115;d011840;2024-10-01 16:44:28;218;Солнце, море, два ствола 1-й сезон 9-я и 10-я серии (16+);2024-10-01 08:00:00;2024-10-01 09:00:00;3407;Сериал;Комедия
                u005115;d011840;2024-10-01 18:18:42;126;Полицейский с Рублевки 4-я серия (16+);2024-10-01 18:00:00;2024-10-01 19:00:00;2478;Сериал;Комедия
                u005115;d011840;2024-10-01 18:18:42;126;Полицейский с Рублевки 5-я серия (16+);2024-10-01 19:00:00;2024-10-01 20:00:00;3600;Сериал;Комедия
                u005115;d011840;2024-10-01 18:18:42;126;Дино 3-я серия (16+);2024-10-01 20:00:00;2024-10-01 20:30:00;1800;Сериал;Комедия, Криминал
                u005115;d011840;2024-10-01 18:18:42;126;Дино 4-я серия (16+);2024-10-01 20:30:00;2024-10-01 21:00:00;1800;Сериал;Комедия, Криминал
                u005115;d011840;2024-10-01 21:49:46;218;Вышка (16+);2024-10-01 20:00:00;2024-10-01 22:10:00;1214;Фильм;Триллер
                u005115;d011840;2024-10-01 23:26:44;218;Пёс-самурай и город кошек (6+);2024-10-01 16:35:00;2024-10-01 18:30:00;0;Детям;Комедия, Семейный, Боевик
                u005115;d011840;2024-10-01 23:35:09;218;Солнце, море, два ствола 1-й сезон (16+);2024-10-01 18:30:00;2024-10-01 19:00:00;1241;Сериал;Комедия
                u005115;d011840;2024-10-02 00:20:42;218;Солнце, море, два ствола 1-й сезон 10-я серия (16+);2024-10-01 19:00:00;2024-10-01 19:30:00;1129;Сериал;Комедия
                u005115;d011840;2024-10-02 01:08:00;218;Солнце, море, два ствола 1-й сезон 10-я серия (16+);2024-10-01 19:00:00;2024-10-01 19:30:00;750;Сериал;Комедия
                u013376;d017870;2024-10-01 08:26:15;257;"Телеканал ""Доброе утро"" ";2024-10-01 05:00:00;2024-10-01 09:00:00;2025;Досуг;Развлекательно-познавательное
                u013376;d017870;2024-10-01 08:26:15;257;Новости (с субтитрами) ;2024-10-01 09:00:00;2024-10-01 09:20:00;1200;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;Модный приговор (0+);2024-10-01 09:20:00;2024-10-01 10:10:00;3000;Досуг;Ток-шоу
                u013376;d017870;2024-10-01 08:26:15;257;Жить здорово! (16+);2024-10-01 10:10:00;2024-10-01 11:00:00;3000;Познавательное;Медицинская
                u013376;d017870;2024-10-01 08:26:15;257;Информационный канал (16+);2024-10-01 11:00:00;2024-10-01 12:00:00;3600;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;Новости (с субтитрами) ;2024-10-01 12:00:00;2024-10-01 12:15:00;900;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;Информационный канал (16+);2024-10-01 12:15:00;2024-10-01 13:30:00;4500;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;АнтиФейк (16+);2024-10-01 13:30:00;2024-10-01 14:00:00;1800;Познавательное;Документальная
                u013376;d017870;2024-10-01 08:26:15;257;Информационный канал (16+);2024-10-01 14:00:00;2024-10-01 15:00:00;3600;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;Новости (с субтитрами) ;2024-10-01 15:00:00;2024-10-01 15:15:00;900;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;Давай поженимся! (16+);2024-10-01 15:15:00;2024-10-01 16:05:00;3000;Досуг;Ток-шоу
                u013376;d017870;2024-10-01 08:26:15;257;Мужское / Женское (16+);2024-10-01 16:05:00;2024-10-01 17:00:00;3300;Досуг;Ток-шоу
                u013376;d017870;2024-10-01 08:26:15;257;Информационный канал (16+);2024-10-01 17:00:00;2024-10-01 18:00:00;3600;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;Вечерние новости (с субтитрами) ;2024-10-01 18:00:00;2024-10-01 18:30:00;1800;Инфо;Информационная
                u013376;d017870;2024-10-01 08:26:15;257;Информационный канал (16+);2024-10-01 18:30:00;2024-10-01 20:00:00;5400;Инфо;Информационная
                u013376;d017870;2024-10-01 20:47:39;216;Информационная программа 112 (16+);2024-10-01 16:00:00;2024-10-01 16:30:00;0;Инфо;Информационная
                u013376;d017870;2024-10-01 20:47:39;216;Новости (16+);2024-10-01 16:30:00;2024-10-01 17:00:00;1800;Инфо;Информационная
                u013376;d017870;2024-10-01 20:47:39;216;Тайны Чапман (16+);2024-10-01 17:00:00;2024-10-01 18:00:00;3600;Познавательное;Расследование
                u013854;d013955;2024-10-01 10:50:04;218;Папины дочки. Новые 2-й сезон 7-я - 11-я серии (12+);2024-10-01 09:00:00;2024-10-01 11:35:00;2696;Сериал;Комедия
                u013854;d013955;2024-10-01 10:50:04;218;Огрики (6+);2024-10-01 11:35:00;2024-10-01 13:20:00;6300;Детям;Семейный
                u013854;d013955;2024-10-01 10:50:04;218;Просто супер (6+);2024-10-01 13:20:00;2024-10-01 14:55:00;5700;Детям;Приключения
                u013854;d013955;2024-10-01 16:37:25;182;Погода 24 ;2024-10-01 16:26:00;2024-10-01 16:38:00;35;Инфо;Информационная
                u013854;d013955;2024-10-01 16:37:25;182;Интервью ;2024-10-01 16:38:00;2024-10-01 17:00:00;1320;Инфо;Интервью
                u013854;d013955;2024-10-01 16:37:25;182;Факты ;2024-10-01 17:00:00;2024-10-01 18:00:00;3600;Инфо;Информационная
                u013854;d013955;2024-10-01 16:37:25;182;Новости ;2024-10-01 18:00:00;2024-10-01 18:35:00;2100;Инфо;Информационная
                u013854;d013955;2024-10-01 16:37:25;182;Вести. Дежурная часть ;2024-10-01 18:35:00;2024-10-01 19:00:00;1500;Инфо;Информационная
                u013854;d013955;2024-10-01 16:37:25;182;Факты ;2024-10-01 19:00:00;2024-10-01 20:02:00;3720;Инфо;Информационная
                u013854;d013955;2024-10-01 16:37:25;182;Вести с Алексеем Казаковым ;2024-10-01 20:02:00;2024-10-01 20:40:00;2280;Инфо;Информационная
                u013854;d013955;2024-10-01 22:20:26;204;Карбот (6+);2024-10-01 22:05:00;2024-10-01 22:30:00;574;Детям;Детский
                u013854;d013955;2024-10-01 22:20:26;204;"Премьера. ""Метазеллс"" (6+)";2024-10-01 22:30:00;2024-10-01 22:40:00;600;Детям;Детский
                u006951;d007962;2024-10-01 10:00:02;257;Модный приговор (0+);2024-10-01 09:20:00;2024-10-01 10:10:00;598;Досуг;Ток-шоу
                u006951;d007962;2024-10-01 10:00:02;257;Жить здорово! (16+);2024-10-01 10:10:00;2024-10-01 11:00:00;3000;Познавательное;Медицинская
                u006951;d007962;2024-10-01 10:00:02;257;Информационный канал (16+);2024-10-01 11:00:00;2024-10-01 12:00:00;3600;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;Новости (с субтитрами) ;2024-10-01 12:00:00;2024-10-01 12:15:00;900;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;Информационный канал (16+);2024-10-01 12:15:00;2024-10-01 13:30:00;4500;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;АнтиФейк (16+);2024-10-01 13:30:00;2024-10-01 14:00:00;1800;Познавательное;Документальная
                u006951;d007962;2024-10-01 10:00:02;257;Информационный канал (16+);2024-10-01 14:00:00;2024-10-01 15:00:00;3600;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;Новости (с субтитрами) ;2024-10-01 15:00:00;2024-10-01 15:15:00;900;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;Давай поженимся! (16+);2024-10-01 15:15:00;2024-10-01 16:05:00;3000;Досуг;Ток-шоу
                u006951;d007962;2024-10-01 10:00:02;257;Мужское / Женское (16+);2024-10-01 16:05:00;2024-10-01 17:00:00;3300;Досуг;Ток-шоу
                u006951;d007962;2024-10-01 10:00:02;257;Информационный канал (16+);2024-10-01 17:00:00;2024-10-01 18:00:00;3600;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;Вечерние новости (с субтитрами) ;2024-10-01 18:00:00;2024-10-01 18:30:00;1800;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;Информационный канал (16+);2024-10-01 18:30:00;2024-10-01 20:00:00;5400;Инфо;Информационная
                u006951;d007962;2024-10-01 10:00:02;257;Ищейка 3-й сезон 5-я серия (16+);2024-10-01 20:00:00;2024-10-01 21:00:00;3600;Сериал;Детектив
                u006951;d007962;2024-10-01 21:51:43;130;Настоящий-2 Укрощение строптивых (16+);2024-09-29 14:45:00;2024-09-29 15:45:00;50;Сериал;Детектив
                u006951;d007962;2024-10-01 22:33:50;130;Настоящий-2 Огни маяка (16+);2024-09-29 15:45:00;2024-09-29 16:40:00;295;Сериал;Детектив
                u006951;d007962;2024-10-01 23:28:00;130;Настоящий-2 Самое дорогое (16+);2024-09-29 16:40:00;2024-09-29 17:35:00;388;Сериал;Детектив
                u006951;d007962;2024-10-01 23:28:00;130;Настоящий-2 Любовник (16+);2024-09-29 17:35:00;2024-09-29 18:30:00;3300;Сериал;Детектив
                u006951;d007962;2024-10-02 00:50:32;257;Ищейка 3-й сезон 5-я серия (16+);2024-10-01 20:00:00;2024-10-01 21:00:00;0;Сериал;Детектив
                u006951;d007962;2024-10-02 01:47:07;218;Солнце, море, два ствола 1-й сезон 10-я серия (16+);2024-10-01 19:00:00;2024-10-01 19:30:00;0;Сериал;Комедия
                u002594;d014609;2024-10-01 21:54:20;126;Волшебный участок 3-я серия (18+);2024-10-01 21:00:00;2024-10-01 22:00:00;340;Сериал;Комедия
                u004071;d007400;2024-10-01 19:55:21;257;Информационный канал (16+);2024-10-01 18:30:00;2024-10-01 20:00:00;279;Инфо;Информационная
                u004071;d007400;2024-10-01 19:55:21;257;Ищейка 3-й сезон 5-я серия (16+);2024-10-01 20:00:00;2024-10-01 21:00:00;3600;Сериал;Детектив
                u004071;d007400;2024-10-01 19:55:21;257;Время ;2024-10-01 21:00:00;2024-10-01 22:00:00;3600;Инфо;Информационная
                u006255;d012069;2024-10-01 04:28:46;129;"Улицы разбитых фонарей-13 11-я серия - ""Собачья смерть"" (16+)";2024-09-30 20:35:00;2024-09-30 21:25:00;520;Сериал;Криминал
                u006255;d012069;2024-10-01 05:48:24;223;"Тайны следствия-17 ""Случай на пробежке"", 1-я серия (16+)";2024-10-01 02:10:00;2024-10-01 03:00:00;2282;Сериал;Детектив
                u006255;d012069;2024-10-01 05:48:24;223;Вести ;2024-10-01 03:00:00;2024-10-01 03:30:00;1800;Инфо;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;"Тайны следствия-17 ""Случай на пробежке"", 2-я серия (16+)";2024-10-01 03:30:00;2024-10-01 04:34:00;803;Сериал;Детектив
                u006255;d012069;2024-10-01 07:25:16;223;Перерыв в вещании ;2024-10-01 04:34:00;2024-10-01 05:00:00;1560;Остальное;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;Утро России ;2024-10-01 05:00:00;2024-10-01 09:00:00;14400;Досуг;Развлекательно-познавательное
                u006255;d012069;2024-10-01 07:25:16;223;Вести ;2024-10-01 09:00:00;2024-10-01 09:30:00;1800;Инфо;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;Местное время. Вести-Воронеж;2024-10-01 09:30:00;2024-10-01 09:55:00;1500;Инфо;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;О самом главном (12+);2024-10-01 09:55:00;2024-10-01 11:00:00;3900;Познавательное;Медицинская
                u006255;d012069;2024-10-01 07:25:16;223;Вести ;2024-10-01 11:00:00;2024-10-01 11:30:00;1800;Инфо;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;60 минут (12+);2024-10-01 11:30:00;2024-10-01 13:00:00;5400;Досуг;Ток-шоу
                u006255;d012069;2024-10-01 07:25:16;223;Наши (12+);2024-10-01 13:00:00;2024-10-01 14:00:00;3600;Досуг;Ток-шоу
                u006255;d012069;2024-10-01 07:25:16;223;Вести ;2024-10-01 14:00:00;2024-10-01 14:30:00;1800;Инфо;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;Местное время. Вести-Воронеж;2024-10-01 14:30:00;2024-10-01 14:55:00;1500;Инфо;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;"Тайны следствия-17 ""Вирус"" - 1-я и 2-я серии (16+)";2024-10-01 14:55:00;2024-10-01 17:00:00;7500;Сериал;Детектив
                u006255;d012069;2024-10-01 07:25:16;223;Вести ;2024-10-01 17:00:00;2024-10-01 17:30:00;1800;Инфо;Информационная
                u006255;d012069;2024-10-01 07:25:16;223;Малахов (16+);2024-10-01 17:30:00;2024-10-01 18:30:00;3600;Досуг;Ток-шоу
                u006255;d012069;2024-10-01 22:13:43;129;"Агент особого назначения 5-я серия - ""Пропала собака"" (12+)";2024-10-01 08:55:00;2024-10-01 10:30:00;2044;Сериал;Детектив
                u002147;d005761;2024-10-01 03:34:25;678;На углу, у Патриарших-2 10-я серия (16+);2024-10-01 03:30:00;2024-10-01 04:30:00;3335;Сериал;Детектив
                u002147;d005761;2024-10-01 03:34:25;678;Узник замка Иф 1-я серия (12+);2024-10-01 04:30:00;2024-10-01 05:45:00;4500;Фильм;Приключения
                u002147;d005761;2024-10-01 03:34:25;678;Черные береты (16+);2024-10-01 05:45:00;2024-10-01 07:10:00;5100;Фильм;Боевик
                u002147;d005761;2024-10-01 03:34:25;678;Ты у меня одна (16+);2024-10-01 07:10:00;2024-10-01 09:10:00;7200;Фильм;Мелодрама
                u002147;d005761;2024-10-01 10:43:28;399;Дети кукурузы (18+);2024-09-30 20:50:00;2024-09-30 22:25:00;0;Фильм;Ужасы, Триллер
                u002147;d005761;2024-10-01 10:43:28;399;Дети кукурузы-2: Последняя жертва (18+);2024-09-30 22:25:00;2024-10-01 00:05:00;6000;Фильм;Ужасы, Триллер
                u002147;d005761;2024-10-01 13:14:30;677;Запретная зона (16+);2024-10-01 11:20:00;2024-10-01 13:15:00;30;Фильм;Триллер
                u002147;d005761;2024-10-01 13:27:25;834;Метод 2-я серия (18+);2024-10-01 13:05:00;2024-10-01 14:10:00;2555;Сериал;Криминал
                u002147;d005761;2024-10-01 13:27:25;834;Чисто английские убийства 19-й сезон 9-я серия (16+);2024-10-01 14:10:00;2024-10-01 15:05:00;3300;Сериал;Детектив, Драма
                u002147;d005761;2024-10-01 13:27:25;834;Чисто английские убийства 19-й сезон 10-я серия (16+);2024-10-01 15:05:00;2024-10-01 16:00:00;3300;Сериал;Детектив, Драма
                u002147;d005761;2024-10-01 13:27:25;834;Чисто английские убийства 19-й сезон 11-я серия (16+);2024-10-01 16:00:00;2024-10-01 17:00:00;3600;Сериал;Детектив, Драма
                u002147;d005761;2024-10-01 17:45:50;211;Возвращение героя (16+);2024-10-01 16:55:00;2024-10-01 19:00:00;4450;Фильм;Боевик
                u002147;d005761;2024-10-01 17:45:50;211;Рейд (16+);2024-10-01 19:00:00;2024-10-01 20:50:00;6600;Фильм;Боевик
                u002147;d005761;2024-10-01 17:45:50;211;Рейд-2 (16+);2024-10-01 20:50:00;2024-10-01 23:35:00;9900;Фильм;Боевик
                u013553;d013583;2024-10-01 11:04:57;204;Спокойной ночи, малыши! (0+);2024-09-30 21:00:00;2024-09-30 21:20:00;106;Детям;Семейный
                u013553;d013583;2024-10-01 11:41:21;204;Геройчики (0+);2024-09-30 17:10:00;2024-09-30 19:00:00;0;Детям;Детский
                u006275;d004274;2024-10-01 10:32:00;179;Тест на отцовство (16+);2024-10-01 08:25:00;2024-10-01 10:40:00;480;Познавательное;ТВ-шоу
                u006275;d004274;2024-10-01 10:32:00;179;"Премьера. ""Понять. Простить"" ""Хитрюга"". ""Удачно обменялись"" (16+)";2024-10-01 10:40:00;2024-10-01 11:45:00;3900;Познавательное;Документальная, Драма
                u006275;d004274;2024-10-01 11:57:57;179;По делам несовершеннолетних (16+);2024-10-01 05:35:00;2024-10-01 06:30:00;0;Познавательное;Ток-шоу
                u006275;d004274;2024-10-01 11:57:57;179;По делам несовершеннолетних (16+);2024-10-01 06:30:00;2024-10-01 07:25:00;3300;Познавательное;Ток-шоу
                u006275;d004274;2024-10-01 13:23:26;130;Известия (16+);2024-10-01 13:00:00;2024-10-01 13:30:00;394;Инфо;Информационная
                u006275;d004274;2024-10-01 13:23:26;130;След Архивная барышня (16+);2024-10-01 13:30:00;2024-10-01 14:20:00;3000;Сериал;Детектив, Драма
                u006275;d004274;2024-10-01 13:23:26;130;След Опасный человек (16+);2024-10-01 14:20:00;2024-10-01 15:05:00;2700;Сериал;Детектив
                u006275;d004274;2024-10-01 13:23:26;130;След Червь (16+);2024-10-01 15:05:00;2024-10-01 16:00:00;3300;Сериал;Детектив, Драма
                u006275;d004274;2024-10-01 16:26:54;258;Дела судебные. Яблоко раздора (16+);2024-10-01 16:15:00;2024-10-01 17:15:00;2886;Досуг;Развлекательно-познавательное
                u006275;d004274;2024-10-01 18:24:04;257;Вечерние новости (с субтитрами) ;2024-10-01 18:00:00;2024-10-01 18:30:00;356;Инфо;Информационная
                u006275;d004274;2024-10-01 19:49:04;104;Сегодня ;2024-10-01 19:00:00;2024-10-01 20:00:00;656;Инфо;Информационная
                u006275;d004274;2024-10-01 20:51:36;258;Игра в кино (16+);2024-10-01 18:50:00;2024-10-01 21:45:00;3204;Досуг;Развлекательно-познавательное
                u006275;d004274;2024-10-01 20:51:36;258;Миллион за 5 минут (16+);2024-10-01 21:45:00;2024-10-01 22:30:00;2700;Досуг;Телеигра
                u006275;d004274;2024-10-01 22:46:54;104;"Невский. Расплата за справедливость ""Свежая кровь"", ""Стань самим собой"" (16+)";2024-10-01 22:15:00;2024-10-01 23:35:00;2886;Сериал;Детектив
                u006275;d004274;2024-10-01 22:46:54;104;Сегодня ;2024-10-01 23:35:00;2024-10-02 00:00:00;1500;Инфо;Информационная
                u013850;d013570;2024-10-01 10:57:25;108;Семь королевств (0+);2024-10-01 10:35:00;2024-10-01 11:05:00;455;Детям;Детский
                u010837;d005348;2024-10-01 03:13:37;106;Книжные аллеи. Адреса и строки Петербург Гоголя (12+);2024-10-01 03:00:00;2024-10-01 03:30:00;983;Познавательное;Документальная
                u010837;d005348;2024-10-01 03:13:37;106;Территория 1-я серия (16+);2024-10-01 03:30:00;2024-10-01 04:20:00;3000;Сериал;Детектив, Драма
                u010837;d005348;2024-10-01 03:13:37;106;Территория 2-я серия (16+);2024-10-01 04:20:00;2024-10-01 05:15:00;3300;Сериал;Детектив, Драма
                u010837;d005348;2024-10-01 03:13:37;106;Преодоление Сергей Ильюшин (12+);2024-10-01 05:15:00;2024-10-01 06:00:00;2700;Познавательное;Познавательная
                u010837;d005348;2024-10-01 03:13:37;106;Большая страна (12+);2024-10-01 06:00:00;2024-10-01 06:50:00;3000;Познавательное;Познавательная
                u010837;d005348;2024-10-01 03:13:37;106;Очень личное с Виктором Лошаком Елена Якович (12+);2024-10-01 06:50:00;2024-10-01 07:30:00;2400;Познавательное;Познавательная
                u010837;d005348;2024-10-01 03:13:37;106;Календарь (6+);2024-10-01 07:30:00;2024-10-01 08:00:00;1800;Познавательное;Развлекательно-познавательное
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 08:00:00;2024-10-01 08:05:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Пёстрый мир ;2024-10-01 08:05:00;2024-10-01 08:30:00;1500;Досуг;Познавательная
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 08:30:00;2024-10-01 08:35:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Пёстрый мир ;2024-10-01 08:35:00;2024-10-01 09:00:00;1500;Досуг;Познавательная
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 09:00:00;2024-10-01 09:05:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 09:05:00;2024-10-01 09:30:00;1500;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 09:30:00;2024-10-01 09:35:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 09:35:00;2024-10-01 10:00:00;1500;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 10:00:00;2024-10-01 10:05:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 10:05:00;2024-10-01 10:30:00;1500;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 10:30:00;2024-10-01 10:35:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 10:35:00;2024-10-01 11:00:00;1500;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Катя и Блэк 6-я серия (16+);2024-10-01 11:00:00;2024-10-01 12:00:00;3600;Сериал;Детектив
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 12:00:00;2024-10-01 12:05:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 12:05:00;2024-10-01 13:00:00;3300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 13:00:00;2024-10-01 13:10:00;600;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 13:10:00;2024-10-01 14:00:00;3000;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 14:00:00;2024-10-01 14:05:00;300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 14:05:00;2024-10-01 15:00:00;3300;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 15:00:00;2024-10-01 15:10:00;600;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Милый друг давно забытых лет... (16+);2024-10-01 15:10:00;2024-10-01 16:45:00;5700;Фильм;Мелодрама
                u010837;d005348;2024-10-01 03:13:37;106;Лиса и заяц (12+);2024-10-01 16:45:00;2024-10-01 17:00:00;900;Детям;Сказка
                u010837;d005348;2024-10-01 03:13:37;106;Моя история Юрий Васильев (16+);2024-10-01 17:00:00;2024-10-01 17:40:00;2400;Познавательное;Биографическая
                u010837;d005348;2024-10-01 03:13:37;106;Специальный репортаж Спутник Владивостока. Территория комфорта (12+);2024-10-01 17:40:00;2024-10-01 18:00:00;1200;Инфо;Репортаж
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 18:00:00;2024-10-01 18:20:00;1200;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;ОТРажение ;2024-10-01 18:20:00;2024-10-01 20:00:00;6000;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Новости ;2024-10-01 20:00:00;2024-10-01 20:10:00;600;Инфо;Информационно-аналитическая
                u010837;d005348;2024-10-01 03:13:37;106;Календарь (6+);2024-10-01 20:10:00;2024-10-01 20:40:00;1800;Познавательное;Развлекательно-познавательное
                u010837;d005348;2024-10-01 03:13:37;106;Территория 3-я серия (16+);2024-10-01 20:40:00;2024-10-01 21:30:00;3000;Сериал;Детектив, Драма
                u010837;d005348;2024-10-01 03:13:37;106;Территория 4-я серия (16+);2024-10-01 21:30:00;2024-10-01 22:25:00;3300;Сериал;Детектив, Драма
                u010837;d005348;2024-10-01 23:43:02;182;Новости ;2024-10-01 23:00:00;2024-10-01 23:44:00;58;Инфо;Информационная
                u010837;d005348;2024-10-01 23:43:02;182;Специальный репортаж ;2024-10-01 23:44:00;2024-10-02 00:00:00;960;Инфо;Репортаж
                u010837;d005348;2024-10-02 00:42:01;182;Новости ;2024-10-02 00:00:00;2024-10-02 00:50:00;479;Инфо;Информационная
                u010837;d005348;2024-10-02 00:58:53;147;Баллада о солдате (12+);2024-10-01 23:15:00;2024-10-02 01:00:00;67;Фильм;Военный
                u010502;d000126;2024-10-01 13:58:42;104;Чрезвычайное происшествие ;2024-10-01 13:25:00;2024-10-01 14:00:00;78;Инфо;Информационная
                u010502;d000126;2024-10-01 13:58:42;104;Место встречи ;2024-10-01 14:00:00;2024-10-01 16:00:00;7200;Досуг;Интервью
                u010502;d000126;2024-10-01 13:58:42;104;Сегодня ;2024-10-01 16:00:00;2024-10-01 16:45:00;2700;Инфо;Информационная
                u010502;d000126;2024-10-01 13:58:42;104;За гранью (16+);2024-10-01 16:45:00;2024-10-01 17:50:00;3900;Досуг;Ток-шоу
                u010502;d000126;2024-10-01 13:58:42;104;ДНК (16+);2024-10-01 17:50:00;2024-10-01 19:00:00;4200;Досуг;Ток-шоу
                u010502;d000126;2024-10-01 13:58:42;104;Сегодня ;2024-10-01 19:00:00;2024-10-01 20:00:00;3600;Инфо;Информационная
                u010502;d000126;2024-10-01 20:30:26;255;"Премьера. ""Блонды"" 4-я серия (16+)";2024-10-01 20:15:00;2024-10-01 21:15:00;2674;Сериал;Детектив
                u010502;d000126;2024-10-01 21:30:25;104;"Премьера. ""Варяги"" 14-я серия (16+)";2024-10-01 21:05:00;2024-10-01 22:15:00;2675;Сериал;Детектив
                u010502;d000126;2024-10-01 23:17:05;104;Итоги недели ;2024-09-29 19:00:00;2024-09-29 20:20:00;0;Инфо;Информационно-аналитическая
                u003935;d017687;2024-10-01 11:35:16;832;Джиперс Криперс (16+);2024-10-01 10:50:00;2024-10-01 12:35:00;3584;Фильм;Ужасы
                u003935;d017687;2024-10-01 11:35:16;832;Тайна проклятой обители (18+);2024-10-01 12:35:00;2024-10-01 14:35:00;7200;Фильм;Ужасы
                u003935;d017687;2024-10-01 11:35:16;832;Бойся темноты (16+);2024-10-01 14:35:00;2024-10-01 16:35:00;7200;Фильм;Драма, Ужасы, Фэнтези
                u003935;d017687;2024-10-01 11:35:16;832;Голоса (18+);2024-10-01 16:35:00;2024-10-01 18:30:00;6900;Фильм;Триллер, Ужасы, Детектив
                u003935;d017687;2024-10-01 11:35:16;832;Время ведьм (16+);2024-10-01 18:30:00;2024-10-01 20:15:00;6300;Фильм;Фэнтези
                u003935;d017687;2024-10-01 11:35:16;832;Открытое море: Монстр глубины (16+);2024-10-01 20:15:00;2024-10-01 22:00:00;6300;Фильм;Триллер, Ужасы
                u003935;d017687;2024-10-01 11:35:16;832;13 изгнаний дьявола (18+);2024-10-01 22:00:00;2024-10-02 00:00:00;7200;Фильм;Ужасы
                u003935;d017687;2024-10-01 11:35:16;832;Гайя: Месть Богов (18+);2024-10-02 00:00:00;2024-10-02 01:40:00;6000;Фильм;Ужасы, Фэнтези
                u002390;d016566;2024-10-01 12:27:26;108;Кошечки-собачки (0+);2024-10-01 09:00:00;2024-10-01 09:25:00;0;Детям;Детский
                u002390;d016566;2024-10-01 12:40:12;108;Время малышей (0+);2024-10-01 12:00:00;2024-10-01 13:00:00;1188;Детям;Развлекательно-познавательное
                u002390;d016566;2024-10-01 13:08:34;108;Фиксики. Новенькие (0+);2024-10-01 10:00:00;2024-10-01 10:35:00;1735;Детям;Семейный
                u002390;d016566;2024-10-01 13:08:34;108;Семь королевств (0+);2024-10-01 10:35:00;2024-10-01 11:05:00;1800;Детям;Детский
                u002390;d016566;2024-10-01 13:08:34;108;Ми-Ми-Мишки (0+);2024-10-01 11:05:00;2024-10-01 11:40:00;2100;Детям;Детский
                u002390;d016566;2024-10-01 13:08:34;108;Хранители Кью (0+);2024-10-01 11:40:00;2024-10-01 12:00:00;1200;Детям;Семейный
                u002390;d016566;2024-10-01 13:08:34;108;Время малышей (0+);2024-10-01 12:00:00;2024-10-01 13:00:00;3600;Детям;Развлекательно-познавательное
                u002390;d016566;2024-10-01 13:08:34;108;"Премьера. ""Тара Дункан"" (6+)";2024-10-01 13:00:00;2024-10-01 13:25:00;1500;Детям;Приключения
                u002390;d016566;2024-10-01 13:08:34;108;Простоквашино (0+);2024-10-01 13:25:00;2024-10-01 14:30:00;3900;Детям;Семейный
                u002390;d016566;2024-10-01 13:08:34;108;Премьера. Спинфайтеры (6+);2024-10-01 14:30:00;2024-10-01 15:00:00;1800;Детям;Детский, Семейный
                u002390;d016566;2024-10-01 19:05:14;104;"Невский. Расплата за справедливость ""Жизнь после смерти"", 1-я и 2-я серии (16+)";2024-10-01 00:00:00;2024-10-01 00:55:00;394;Сериал;Детектив
                u002390;d016566;2024-10-01 19:05:14;104;Скорая помощь-2 1-я серия (16+);2024-10-01 00:55:00;2024-10-01 01:40:00;2700;Сериал;Драма
                """;
        try {
            CSVParser csvParser = new CSVParser(data);
            csvParser.next();
            List<View> list = ViewParser.parse(csvParser.consume());
            for (View view : list) {
                System.out.printf("BC: %s -- %s : %ss%n", view.broadcast.start.format(ViewParser.DATE_TIME_FORMAT),
                        view.broadcast.end.format(ViewParser.DATE_TIME_FORMAT), view.broadcast.duration.toSeconds());
                System.out.printf("CL: %s -- %s : %ss%n%n", view.start.format(ViewParser.DATE_TIME_FORMAT),
                        view.end.format(ViewParser.DATE_TIME_FORMAT), view.duration.toSeconds());
            }
        } catch (Exception ex) {
            System.err.println(ex.getMessage());
        }
    }

    // @Test
    public void clientTest() {
        String data = """
                client;address;gender;age
                u011766;улица Артамонова, 16;m;60-69
                u008046;улица Карла Маркса, 98;M;60-69
                u008053;улица 45 Стрелковой Дивизии, 285;M;40-49
                u003790;улица Юлюса Янониса, 5;Ж;40-49
                u006932;улица Беговая, 219/3;M;40-49
                u005115;улица Беговая, 168;Ж;30-39
                u013376;улица Берег реки Дон, 29-е;M;30-39
                u013854;улица Острогожская, 170/4;Ж;30-39
                u006951;проспект Патриотов, 38-а;Ж;40-49
                """;
        CSVParser csvParser = new CSVParser(data);
        try {
            csvParser.next();
            List<Client> list = ClientParser.parse(csvParser.consume());
            for (Client client : list) {

            }
        } catch (Exception ex) {
            System.err.println(ex.getMessage());
        }
    }
}
